## Plan Result (stg)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 7 to add, 0 to change, 7 to destroy.</code></pre>

* Replace
  * azurerm_key_vault_access_policy.this
  * azurerm_resource_group.this
  * azurerm_service_plan.this
  * azurerm_storage_account.this
  * azurerm_user_assigned_identity.this
  * azurerm_windows_function_app.this
  * module.application_insights.azurerm_application_insights.this




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_access_policy.this must be replaced
-/+ resource "azurerm_key_vault_access_policy" "this" {
      - certificate_permissions = [] -> null
      ~ id                      = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/genesis-rg/providers/Microsoft.KeyVault/vaults/dcdcftappsstgkv/objectId/dcf49360-e82f-468f-884c-90426ad1ed54" -> (known after apply)
      - key_permissions         = [] -> null
      ~ object_id               = "dcf49360-e82f-468f-884c-90426ad1ed54" # forces replacement -> (known after apply) # forces replacement
      - storage_permissions     = [] -> null
        # (3 unchanged attributes hidden)
    }

  # azurerm_resource_group.this must be replaced
-/+ resource "azurerm_resource_group" "this" {
      ~ id       = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/alerts-slack-aat" -> (known after apply)
      ~ name     = "alerts-slack-aat" -> "alerts-slack-stg" # forces replacement
        tags     = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-alert-to-slack-function"
            "businessArea" = "CFT"
            "criticality"  = "High"
            "environment"  = "staging"
            "startupMode"  = "always"
        }
        # (1 unchanged attribute hidden)
    }

  # azurerm_service_plan.this must be replaced
-/+ resource "azurerm_service_plan" "this" {
      ~ id                           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/alerts-slack-aat/providers/Microsoft.Web/serverFarms/alerts-slack-aat" -> (known after apply)
      ~ kind                         = "functionapp" -> (known after apply)
      ~ maximum_elastic_worker_count = 1 -> (known after apply)
      ~ name                         = "alerts-slack-aat" -> "alerts-slack-stg" # forces replacement
      ~ reserved                     = false -> (known after apply)
      ~ resource_group_name          = "alerts-slack-aat" -> "alerts-slack-stg" # forces replacement
        tags                         = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-alert-to-slack-function"
            "businessArea" = "CFT"
            "criticality"  = "High"
            "environment"  = "staging"
            "startupMode"  = "always"
        }
      ~ worker_count                 = 0 -> (known after apply)
      - zone_balancing_enabled       = false -> null
        # (4 unchanged attributes hidden)
    }

  # azurerm_storage_account.this must be replaced
-/+ resource "azurerm_storage_account" "this" {
      ~ access_tier                        = "Hot" -> (known after apply)
      ~ id                                 = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/alerts-slack-aat/providers/Microsoft.Storage/storageAccounts/alertsslackaat" -> (known after apply)
      + large_file_share_enabled           = (known after apply)
      ~ name                               = "alertsslackaat" -> "alertsslackstg" # forces replacement
      ~ primary_access_key                 = (sensitive value)
      ~ primary_blob_connection_string     = (sensitive value)
      ~ primary_blob_endpoint              = "https://alertsslackaat.blob.core.windows.net/" -> (known after apply)
      ~ primary_blob_host                  = "alertsslackaat.blob.core.windows.net" -> (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      ~ primary_connection_string          = (sensitive value)
      ~ primary_dfs_endpoint               = "https://alertsslackaat.dfs.core.windows.net/" -> (known after apply)
      ~ primary_dfs_host                   = "alertsslackaat.dfs.core.windows.net" -> (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      ~ primary_file_endpoint              = "https://alertsslackaat.file.core.windows.net/" -> (known after apply)
      ~ primary_file_host                  = "alertsslackaat.file.core.windows.net" -> (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      ~ primary_location                   = "uksouth" -> (known after apply)
      ~ primary_queue_endpoint             = "https://alertsslackaat.queue.core.windows.net/" -> (known after apply)
      ~ primary_queue_host                 = "alertsslackaat.queue.core.windows.net" -> (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      ~ primary_table_endpoint             = "https://alertsslackaat.table.core.windows.net/" -> (known after apply)
      ~ primary_table_host                 = "alertsslackaat.table.core.windows.net" -> (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      ~ primary_web_endpoint               = "https://alertsslackaat.z33.web.core.windows.net/" -> (known after apply)
      ~ primary_web_host                   = "alertsslackaat.z33.web.core.windows.net" -> (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      ~ resource_group_name                = "alerts-slack-aat" -> "alerts-slack-stg" # forces replacement
      ~ secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      ~ secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
        tags                               = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-alert-to-slack-function"
            "businessArea" = "CFT"
            "criticality"  = "High"
            "environment"  = "staging"
            "startupMode"  = "always"
        }
        # (17 unchanged attributes hidden)

      - blob_properties {
          - change_feed_enabled           = false -> null
          - change_feed_retention_in_days = 0 -> null
          - last_access_time_enabled      = false -> null
          - versioning_enabled            = false -> null
        }

      - network_rules {
          - bypass                     = [
              - "AzureServices",
            ] -> null
          - default_action             = "Allow" -> null
          - ip_rules                   = [] -> null
          - virtual_network_subnet_ids = [] -> null
        }

      - queue_properties {
          - hour_metrics {
              - enabled               = true -> null
              - include_apis          = true -> null
              - retention_policy_days = 7 -> null
              - version               = "1.0" -> null
            }
          - logging {
              - delete                = false -> null
              - read                  = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
              - write                 = false -> null
            }
          - minute_metrics {
              - enabled               = false -> null
              - include_apis          = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
            }
        }

      - share_properties {
          - retention_policy {
              - days = 7 -> null
            }
        }
    }

  # azurerm_user_assigned_identity.this must be replaced
-/+ resource "azurerm_user_assigned_identity" "this" {
      ~ client_id           = "02d204ff-8ee1-4c59-a3e4-6ba084b995c9" -> (known after apply)
      ~ id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/alerts-slack-aat/providers/Microsoft.ManagedIdentity/userAssignedIdentities/alerts-slack-aat" -> (known after apply)
      ~ name                = "alerts-slack-aat" -> "alerts-slack-stg" # forces replacement
      ~ principal_id        = "dcf49360-e82f-468f-884c-90426ad1ed54" -> (known after apply)
      ~ resource_group_name = "alerts-slack-aat" -> "alerts-slack-stg" # forces replacement
      - tags                = {
          - "application"  = "core"
          - "builtFrom"    = "hmcts/azure-alert-to-slack-function"
          - "businessArea" = "CFT"
          - "environment"  = "staging"
        } -> null
      ~ tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # azurerm_windows_function_app.this must be replaced
-/+ resource "azurerm_windows_function_app" "this" {
      ~ app_settings                                   = {
          - "AZURE_CLIENT_ID"          = "02d204ff-8ee1-4c59-a3e4-6ba084b995c9"
          - "AzureWebJobsFeatureFlags" = "EnableWorkerIndexing"
          - "BOT_TOKEN_SECRET_NAME"    = "alerts-slack-bot-token"
          - "KEY_VAULT_NAME"           = "dcdcftappsstgkv"
          - "SIGNING_SECRET_NAME"      = "alerts-slack-signing-secret"
          - "WEBSITE_RUN_FROM_PACKAGE" = "1"
        } -> (known after apply)
      ~ custom_domain_verification_id                  = (sensitive value)
      ~ default_hostname                               = "alerts-slack-aat.azurewebsites.net" -> (known after apply)
      + hosting_environment_id                         = (known after apply)
      ~ https_only                                     = false -> (known after apply)
      ~ id                                             = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/alerts-slack-aat/providers/Microsoft.Web/sites/alerts-slack-aat" -> (known after apply)
      ~ key_vault_reference_identity_id                = "SystemAssigned" -> (known after apply)
      ~ kind                                           = "functionapp" -> (known after apply)
      ~ name                                           = "alerts-slack-aat" -> "alerts-slack-stg" # forces replacement
      ~ outbound_ip_address_list                       = [
          - "20.108.102.154",
          - "20.108.102.165",
          - "20.90.246.67",
          - "20.108.100.12",
          - "20.117.253.100",
          - "20.117.253.169",
          - "20.90.134.19",
        ] -> (known after apply)
      ~ outbound_ip_addresses                          = "20.108.102.154,20.108.102.165,20.90.246.67,20.108.100.12,20.117.253.100,20.117.253.169,20.90.134.19" -> (known after apply)
      ~ possible_outbound_ip_address_list              = [
          - "20.108.102.154",
          - "20.108.102.165",
          - "20.90.246.67",
          - "20.108.100.12",
          - "20.117.253.100",
          - "20.117.253.169",
          - "20.117.248.35",
          - "20.108.101.75",
          - "20.108.103.238",
          - "20.90.243.233",
          - "20.117.253.213",
          - "20.117.254.189",
          - "20.117.254.194",
          - "20.117.254.198",
          - "20.117.254.207",
          - "20.117.254.222",
          - "20.108.103.228",
          - "20.90.246.95",
          - "20.117.251.38",
          - "20.117.248.213",
          - "20.117.252.76",
          - "20.117.254.227",
          - "20.117.254.232",
          - "20.117.254.238",
          - "20.108.100.20",
          - "20.117.249.196",
          - "20.117.252.84",
          - "20.117.250.87",
          - "20.117.255.25",
          - "20.117.255.27",
          - "20.90.134.19",
        ] -> (known after apply)
      ~ possible_outbound_ip_addresses                 = "20.108.102.154,20.108.102.165,20.90.246.67,20.108.100.12,20.117.253.100,20.117.253.169,20.117.248.35,20.108.101.75,20.108.103.238,20.90.243.233,20.117.253.213,20.117.254.189,20.117.254.194,20.117.254.198,20.117.254.207,20.117.254.222,20.108.103.228,20.90.246.95,20.117.251.38,20.117.248.213,20.117.252.76,20.117.254.227,20.117.254.232,20.117.254.238,20.108.100.20,20.117.249.196,20.117.252.84,20.117.250.87,20.117.255.25,20.117.255.27,20.90.134.19" -> (known after apply)
      ~ resource_group_name                            = "alerts-slack-aat" -> "alerts-slack-stg" # forces replacement
      ~ service_plan_id                                = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/alerts-slack-aat/providers/Microsoft.Web/serverFarms/alerts-slack-aat" -> (known after apply)
      ~ site_credential                                = (sensitive value)
      ~ storage_account_access_key                     = (sensitive value)
      ~ storage_account_name                           = "alertsslackaat" -> "alertsslackstg"
      ~ tags                                           = {
            "application"                                    = "core"
            "builtFrom"                                      = "hmcts/azure-alert-to-slack-function"
            "businessArea"                                   = "CFT"
            "criticality"                                    = "High"
            "environment"                                    = "staging"
          - "hidden-link: /app-insights-conn-string"         = "InstrumentationKey=76153789-44a0-409c-9941-0bb225d949e5;IngestionEndpoint=https://uksouth-1.in.applicationinsights.azure.com/;LiveEndpoint=https://uksouth.livediagnostics.monitor.azure.com/" -> null
          - "hidden-link: /app-insights-instrumentation-key" = "76153789-44a0-409c-9941-0bb225d949e5" -> null
          - "hidden-link: /app-insights-resource-id"         = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/alerts-slack-aat/providers/microsoft.insights/components/alerts-aat" -> null
            "startupMode"                                    = "always"
        }
      + zip_deploy_file                                = (known after apply)
        # (12 unchanged attributes hidden)

      ~ identity {
          ~ identity_ids = [
              - "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/alerts-slack-aat/providers/Microsoft.ManagedIdentity/userAssignedIdentities/alerts-slack-aat",
            ] -> (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
            # (1 unchanged attribute hidden)
        }

      ~ site_config {
          ~ always_on                              = false -> (known after apply)
          ~ app_scale_limit                        = 200 -> (known after apply)
          ~ application_insights_connection_string = (sensitive value)
          ~ default_documents                      = [
              - "Default.htm",
              - "Default.html",
              - "Default.asp",
              - "index.htm",
              - "index.html",
              - "iisstart.htm",
              - "default.aspx",
              - "index.php",
            ] -> (known after apply)
          ~ detailed_error_logging_enabled         = false -> (known after apply)
          ~ elastic_instance_minimum               = 0 -> (known after apply)
          ~ health_check_eviction_time_in_min      = 0 -> (known after apply)
          ~ pre_warmed_instance_count              = 0 -> (known after apply)
          ~ remote_debugging_version               = "VS2019" -> (known after apply)
          - runtime_scale_monitoring_enabled       = false -> null
          ~ scm_type                               = "VSTSRM" -> (known after apply)
          + windows_fx_version                     = (known after apply)
          ~ worker_count                           = 1 -> (known after apply)
            # (11 unchanged attributes hidden)

          ~ application_stack {
              ~ use_custom_runtime          = false -> (known after apply)
              ~ use_dotnet_isolated_runtime = false -> (known after apply)
                # (2 unchanged attributes hidden)
            }
        }
    }

  # module.application_insights.azurerm_application_insights.this must be replaced
-/+ resource "azurerm_application_insights" "this" {
      ~ app_id                                = "db4aab2e-cce5-4e28-a6ac-4d3be9288ecc" -> (known after apply)
      ~ connection_string                     = (sensitive value)
      ~ daily_data_cap_notifications_disabled = false -> (known after apply)
      ~ id                                    = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/alerts-slack-aat/providers/Microsoft.Insights/components/alerts-aat" -> (known after apply)
      ~ instrumentation_key                   = (sensitive value)
      ~ name                                  = "alerts-aat" -> "alerts-stg" # forces replacement
      ~ resource_group_name                   = "alerts-slack-aat" -> "alerts-slack-stg" # forces replacement
        tags                                  = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-alert-to-slack-function"
            "businessArea" = "CFT"
            "criticality"  = "High"
            "environment"  = "staging"
            "startupMode"  = "always"
        }
        # (11 unchanged attributes hidden)
    }

Plan: 7 to add, 0 to change, 7 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":17,"Program":"tfcmt","SHA1":"","Target":"stg","Vars":{}} -->